const ABOUT = `
    Даний бот створений для отримання  подій по приладу в режимі реального часу, сповіщення клієнта про поточний стан приладу, а також додатково є можливість управління групами приладу (Постановка/Зняття).
    \n
    Перелік всіх доступних команд:
    /start - початок роботи з ботом. Необхідно зареєструвати свій тел. номер (Меню/Надіслати свій контакт);
    /addppk [номер приладу] - підписатися на свій номер приладу;
    /devicestate - отримати поточний стан приладу;
    /addserialpass [серійний номер:пароль приладу] - додати серійний номер та пароль свого приладу, після чого буде доступна можливість управління групами;
    /setgr - відобразити кнопки для управління групами приладу;
    /about - про бота;
    /stop - видалити всі свої дані на сервері та відписатися.
`;

const userMenuArray = [
    { command: '/start', description: 'Зареєструвати телефонний номер' },                        
    { command: '/devicestate', description: 'Відобразити стан приладу' },
    { command: '/setgr', description: 'Постановка/Зняття груп приладу' },
    { command: '/about', description: 'Про бота' },
    { command: '/stop', description: 'Видалити дані та зупинити спов.' },
];

module.exports = {
    ABOUT,
    userMenuArray
};